verification/runs/F14-cooling-ladder/K0cG_runs/S_KE_x/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantBoussinesqSimpleFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         40000;
deltaT          1;
writeControl    timeStep;
writeInterval   2000;
purgeWrite      2;
writeFormat     ascii;
writePrecision  16;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    gradT
    {
        type            grad;
        libs            (fieldFunctionObjects);
        field           T;
        result          k0csGradT;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    none;
        log             false;
    }
    hotFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            hotWall;
        operation       areaNormalIntegrate;
        fields          (k0csGradT);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    coldFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            coldWall;
        operation       areaNormalIntegrate;
        fields          (k0csGradT);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    botFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            bottomWall;
        operation       areaNormalIntegrate;
        fields          (k0csGradT);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    topFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            topWall;
        operation       areaNormalIntegrate;
        fields          (k0csGradT);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    coreT
    {
        type            probes;
        libs            (sampling);
        fields          (T);
        probeLocations
        (
            (0.37500000 0.22500000 0.005)
            (0.37500000 0.26250000 0.005)
            (0.37500000 0.30000000 0.005)
            (0.37500000 0.33750000 0.005)
            (0.37500000 0.37500000 0.005)
            (0.37500000 0.41250000 0.005)
            (0.37500000 0.45000000 0.005)
            (0.37500000 0.48750000 0.005)
            (0.37500000 0.52500000 0.005)
        );
        interpolationScheme cell;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    Uymax
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      all;
        operation       max;
        fields          (U);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    Uymin
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      all;
        operation       min;
        fields          (U);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
}

// ******************************************************** //
